//*****************************************************************************
//
//     ライトの処理[light.h]
//     Auther:Hodaka Niwa
//
//*****************************************************************************
#ifndef _LIGHT_H_
#define _LIGHT_H_

//*****************************************************************************
//    インクルードファイル
//*****************************************************************************
#include "main.h"

//*****************************************************************************
//    マクロ定義
//*****************************************************************************
#define MAX_LIGHT (3)    // ライトオブジェクトの総数

//*****************************************************************************
//    ライトクラスの定義
//*****************************************************************************
class CLight
{
public:    // 誰でもアクセス可能
	CLight();
	~CLight();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

protected: // このクラスと派生クラスだけがアクセス可能

private:   // このクラスだけがアクセス可能
	D3DLIGHT9 m_Light[MAX_LIGHT];   // ライトの情報

#ifdef _DEBUG  // デバッグに必要な変数
	int       m_nSelectLight;       // 現在選択しているライトの番号
#endif
};

#endif